Repository: mishin/perldoc-ru
Catalog: pod2-ru/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: It's widely used for everything from quick "one-liners" to full-scale application development.
ru_ru: Он широко используется для всего, от быстрых "однострочников" до полномасштабной разработки приложений.

source: Iteration over a hash is done using the keys() function, but iteration over an array is NOT.
ru_ru: Перебор хэша может быть с помощью комбинации функции keys(), но это не подходит для перебора массива.

source: Its general-purpose programming facilities support procedural, functional, and object-oriented programming paradigms, making Perl a comfortable language for the long haul on major projects, whatever your bent.
ru_ru: Его обще-целевые программистские возможности поддерживают процедурные, функциональные и объектно-ориентированных парадигмы программирования, что делает Perl удобным языком для долгого пути по крупным проектам, независимо от извилистости пути.

source: Its major features are that it's easy to use, supports both procedural and object-oriented (OO) programming, has powerful built-in support for text processing, and has one of the world's most impressive collections of third-party modules.
ru_ru: Основными функциями языка являются то, что он прост в использовании, поддерживает процедурные и объектно-ориентированных (ОО) парадигмы программирования, имеет мощную встроенную поддержку для обработки текста, и имеет одну из самых впечатляющих в мире коллекций сторонних модулей.

source: Just like special scalars and arrays, there are also special hashes.
ru_ru: Так же, как специальные скаляры и массивы, существуют также специальные хэши.

source: Known to be buggy in this release (5.14).
ru_ru: Известный как детский баг(buggy) в этой версии (5.14).

source: L 64 normally the "IOEioA" are unconditional, the L makes
ru_ru: L 64 обычно "IOEioA" являются безусловными, L являются безусловными (normally the "IOEioA" are unconditional, the L makes)

source: L<perlfaq> contains questions and answers related to many common tasks, and often provides suggestions for good CPAN modules to use.
ru_ru: L<perlfaq> содержит вопросы и ответы, связанные с большинством общих задач, и часто дает хорошие предложения для использования CPAN модулей.

source: L<perlmod> describes Perl modules in general.
ru_ru: L<perlmod> описывает Perl модулей в целом.

source: L<perlmodlib> lists the modules which came with your Perl installation.
ru_ru: L<perlmodlib> список модулей, которые поставляются вместе с Perl установкой.

source: Larry Wall <larry@wall.org>, with the help of oodles of other folks.
ru_ru: Ларри Уолл <larry@wall.org>, с помощью кучи других людей.

source: Larry Wall E<lt>F<larry@wall.org>E<gt>
ru_ru: Лари Волл E<lt>F<larry@wall.org>E<gt>

source: Layers it makes sense to include in the PERLIO environment variable are briefly summarized below.
ru_ru: Слои имеет смысл включить в переменную среды PERLIO кратко изложены ниже.

source: Leading and trailing colons can be used together if you need positional parameter values without the names.
ru_ru: Начальные и конечные двоеточия могут быть использованы вместе, если вам нужно значения позиционных параметров без имен.

source: Leading garbage will be discarded until the first line that starts with C<#!> and contains the string "perl".
ru_ru: Ведущие мусора не будет отброшен до первой строке, которая начинается с C<#!> и содержит строку "Perl".

source: Like B<-T>, but taint checks will issue warnings rather than fatal errors.
ru_ru: Как и B<-T>, но проверки заразы (разрушения) будет выносить предупреждения, а не фатальных ошибок.

source: Line numbers displayed by diagnostics are internally stored as short integers, so they are limited to a maximum of 65535 (higher numbers usually being affected by wraparound).
ru_ru: Номера строк отображаются диагностики внутренней памяти как короткие целые, поэтому они ограничиваются максимум 65535 (большие числа обычно под воздействием запахом).

source: Low-level layer that calls C<read>, C<write>, C<lseek>, etc.
ru_ru: Низкий уровень слоя, который вызывает C<read> , C<write> , C<lseek> и т.д.

source: Make sure to use semicolons where you would in a normal program.
ru_ru: Убедитесь в том, что вы используете точку с запятой там, где вы были использовали ее в нормальной программе.

source: Many of the beginner-level books, too, go over basic features and techniques that are still valid today.
ru_ru: Многие из начального уровня книги, тоже переходят основные функции и методы, которые актуальны и сегодня.

source: Many operators can be combined with a C<=> as follows:
ru_ru: Многие операторы могут быть объединены с C<=> следующим образом:

source: Modules following this convention all play nicely with each other.
ru_ru: Модули следующие этому соглашению все дружат друг с другом.

source: More complex data types can be constructed using references, which allow you to build lists and hashes within lists and hashes.
ru_ru: Более сложные типы данных можно построить с помощью ссылок, которые позволяют создавать списки и хэши внутри списков и хэшей.

source: More detailed information about Perl syntax can be found in L<perlsyn>.
ru_ru: Более подробные сведения о синтаксисе Perl можно найти в L<perlsyn> .

source: Most of these books are available online through Safari Books Online ( http://safaribooksonline.com/ ).
ru_ru: Большинство из этих книг доступны в онлайновом режиме через Safari Books Online (http://safaribooksonline.com/).

source: Most switches don't actually care if they're processed redundantly, but getting a "-" instead of a complete switch could cause Perl to try to execute standard input instead of your program.
ru_ru: Большинство переключатели на самом деле не волнует, если они обработаны избыточно, но получение "-" вместо полных опций, может привести к тому, что Perl будет попытаться выполнить скрипт со стандартного ввода, а не из вашей программы.

source: Most text file processing can be done a line at a time with Perl's looping constructs.
ru_ru: Большинство средств обработки текстовых файлов можно сделать с помощью циклических конструкций Perl.

source: Multiple B<-e> commands may be given to build up a multi-line script.
ru_ru: Несколько B<-e> команд может быть дано, чтобы построить многострочный сценарий.

source: Near the top of the line loop will be the split operation that is implicit in the awk script.
ru_ru: В верхней части линии цикла будет операция разбиения по частям (split), которая подразумевается в сценарий AWK.

source: Nested modules (such as C<File::Basename>) are specified either as C<File::Basename> or C<< File/Basename >>.
ru_ru: Модули вида C<File::Basename> могут быть определены как C<File::Basename> или C<File/Basename>.

source: Not everything in Perl changes every day.
ru_ru: Не все в Perl меняется каждый день.

source: Note how we load the user pragma C<myint> with an empty list C<()> to prevent its C<import> being called.
ru_ru: Примечание. При загрузке пользовательской прагмы C<myint> без параметров С<()> функция C<import> не будет вызвана.

source: Note that this means you can no longer tell the difference between an executable Perl program and a Perl library file.
ru_ru: Заметим, что это означает, что вы больше не можете отличить исполняемые программы Perl и Perl файл библиотеки.

source: Note that Perl doesn't use COMSPEC for this purpose because COMSPEC has a high degree of variability among users, leading to portability concerns.
ru_ru: Следует отметить, что Perl не использует COMSPEC для этой цели, поскольку COMSPEC имеет высокую степень изменчивости среди пользователей, что приводит к переносимости проблем.

source: Note that STDOUT is restored as the default output filehandle after the loop.
ru_ru: Обратите внимание, что STDOUT восстанавливается как дескриптор файла вывода по умолчанию после цикла.

source: Note that because B<-i> renames or deletes the original file before creating a new file of the same name, Unix-style soft and hard links will not be preserved.
ru_ru: Отметим, что поскольку B<-i> переименовывает или удаляет исходный файл перед созданием нового файла с таким же названием, Unix-стиль мягкие и жесткие ссылки не будут сохранены.

source: Note that in the case below, the C<PERL_API> params are returned in alphabetical order.
ru_ru: Следует отметить, что в том случае, ниже, C<PERL_API> параметры возвращаются в алфавитном порядке.

source: Note that the lines are printed automatically.
ru_ru: Следует отметить, что строки печатаются автоматически.

source: Note that the C<:stdio> layer does I<not> do CRLF translation even if that is the platform's normal behaviour.
ru_ru: Следует отметить, что C<:stdio> слой делает I<не> CRLF сделать перевод даже, если это нормальное поведение платформы.

source: Note that the C<=> form removes the distinction between B<-m> and B<-M>.
ru_ru: Обратите внимание, что форма C<=> стирает различие между B<-m> и B<-M>.

source: Note that the assignment C<$\ = $/> is done when the switch is processed, so the input record separator can be different than the output record separator if the B<-l> switch is followed by a B<-0> switch:
ru_ru: Обратите внимание, что назначение C<$\ = $/> делается, когда переключатель обрабатывается, поэтому разделитель входных записей может отличаться от разделителя выходных записей, если ключ B<-l> следует за ключом B<-0>:

source: Note that the braces are required in Perl, even if you've only got one line in the block.
ru_ru: Обратите внимание, что фигурные скобки необходимы в Perl, даже если у вас только одна строка в блоке.

source: Note that the lines are not printed by default.
ru_ru: Следует отметить, что строки не выводятся (not printed) по умолчанию.

source: Note that this is not a boolean variable.
ru_ru: Отметим, что это не имеет значение переменной.

source: Note that warnings must be enabled along with this option to actually I<generate> the taint-check warnings.
ru_ru: Обратите внимание, что предупреждения (warnings) должны быть включены вместе с этим параметром, чтобы на самом деле I <генерировать> предупреждения метко-проверки (taint-check warnings).

source: Note: availability of I<undump> is platform specific and may not be available for a specific port of Perl.
ru_ru: Примечание: наличие I<undump> зависит от платформы и может быть не доступно для конкретного порта Perl.

source: Now we can use the subroutine just as any other built-in function:
ru_ru: Теперь мы можем воспользоваться подпрограммой как и любой другой встроенной функцией:

source: Numbers don't need quotes around them:
ru_ru: Числа не нуждаются в кавычках вокруг них:

source: O 2 STDOUT will be in UTF-8
ru_ru: O 2 STDOUT будет в UTF-8

source: OO Perl is relatively simple and is implemented using references which know what sort of object they are based on Perl's concept of packages.
ru_ru: OO Perl относительно проста и осуществляется с помощью ссылок, которые знают на основе какого объекта они созданы, объекты основаны на концепции Perl-пакетов.

source: Of course, C<END> blocks will be likewise executed very late.
ru_ru: Конечно, C<END> блоки будут также выполнены очень поздно.

source: Of course, it'll need to be executable first, so C<chmod 755 script.pl> (under Unix).
ru_ru: Конечно файлу нужно дать права на исполнение, поэтому C<chmod 755 script.pl> (under Unix).

source: Often the shell script wrapper can be incorporated into the perl script, since perl can start up pipes into and out of itself, and can do other things that awk can't do by itself.
ru_ru: Часто обертка скрипта может быть включена в сценарий Perl, так как Perl может начаться до конвейера (pipe - "|" ) в и из себя, и делать другие вещи, которые AWK не может сделать сам по себе.

source: Old awk always has a line loop, even if there are no line actions, whereas new awk does not.
ru_ru: Старый AWK всегда имеет цикл по строкам, даже если нет никаких действий, в то время как новый AWK нет.

source: On DOS-like platforms, if the program does not contain directory separators, it will first be searched for in the current directory before being searched for on the PATH.
ru_ru: На DOS-подобных платформах, если программа не содержит разделителей директорий, то он сначала будет искаться в текущем каталоге, прежде чем искать в PATH.

source: On Unix platforms, the program will be searched for strictly on the PATH.
ru_ru: В Unix платформ, программа будет искать строго в PATH.

source: On Win32 platforms this I<experimental> layer uses native "handle" IO rather than a Unix-like numeric file descriptor layer.
ru_ru: На платформе Win32 это I<экспериментальный> уровень использует родной "ручки" IO, а не Unix-подобных числовых слоя дескриптор файла.

source: On Win32 ports only, may be set to an alternative shell that Perl must use internally for executing "backtick" commands or system().
ru_ru: В Win32 только порты, может быть установлен в альтернативную оболочку, которая должна использовать Perl внутренне для выполнения "обратные" ("backtick") команды или system().

source: On Win32 the default in this release (5.14) is "unix crlf".
ru_ru: В Win32 по умолчанию в этой версии (5.14) является "unix crlf".

source: On a Unix-like system, these documentation files will usually also be available as manpages for use with the F<man> program.
ru_ru: На Unix-подобных системах, эти файлы документов, как правило, также будет доступны как страницы руководств для использования с программой F<man> .

source: On some platforms, this also makes Perl append suffixes to the filename while searching for it.
ru_ru: На некоторых платформах, это также делает Perl добавления суффикса к имени файла при поиске его.

source: On some systems $0 doesn't always contain the full pathname, so the B<-S> tells Perl to search for the program if necessary.
ru_ru: На некоторых системах $0 не всегда содержит полный путь, так что B<-S> говорит Perl путь для поиска программы в случае необходимости.

source: On some systems, you may have to change single-quotes to double ones, which you must I<not> do on Unix or Plan 9 systems.
ru_ru: На некоторых системах, вы, возможно, придется изменить одинарные кавычки на двойные, то, что вы I<не> должны делать на Unix или Plan 9 системах.

source: One can also use the B<-w> flag, but its use is normally discouraged, because it gets applied to all executed Perl code, including that not under your control.
ru_ru: Можно также использовать B<-w> флаг, о его использование, как правило, не рекомендуется, потому что он будет применяться ко всему исполняемуму коду Perl, в том числе, который не под вашим контролем.

source: One useful value for C<PERLDOC_PAGER> is C<less -+C -E>.
ru_ru: Одно из полезных значений для C<PERLDOC_PAGER> - это C<less -+C -E>.

source: Only the B<-[CDIMUdmtwW]> switches are allowed.
ru_ru: Только B &lt;- [CDIMUdmtwW]&gt; переключатели допускается.

source: Options include:
ru_ru: Параметры включают в себя:

source: Or even to place backup copies of the original files into another directory (provided the directory already exists):
ru_ru: Или даже размещает резервные копии оригинальных файлов в другом каталоге (при условии, что каталог уже существует):

source: Ordinarily these checks are done only when running setuid or setgid.
ru_ru: Обычно эти проверки осуществляются только при работе SETUID или SETGID.

source: Other systems can't control that, and need a totally devious construct that will work under any of I<csh>, I<sh>, or Perl, such as the following:
ru_ru: Другие системы не могут контролировать это, и нужно полностью окольные конструкцию, которая будет работать под любой из I<csh>, I<sh>, или Perl, такие как следующие:

source: Other logical names that affect Perl on VMS include PERLSHR, PERL_ENV_TABLES, and SYS$TIMEZONE_DIFFERENTIAL, but are optional and discussed further in L<perlvms> and in F<README.vms> in the Perl source distribution.
ru_ru: Другие логические имена, которые влияют на Perl VMS включают PERLSHR, PERL_ENV_TABLES и SYS$TIMEZONE_DIFFERENTIAL, но не являются обязательными и обсуждается в L<perlvms> и F<README.vms> в Perl распределения источника.

source: Other switches may precede or follow the digits.
ru_ru: Другие переключатели могут предшествовать или следовать за цифрами.

source: Over the years, Perl has grown into a general-purpose programming language.
ru_ru: По прошествии многих лет, Perl вырос в язык программирования общего назначения.

source: PageName|ModuleName|ProgramName|URL
ru_ru: ИмяСтраницы|НазваниеМодуля|НазваниеПрограммы|URL

source: Parsing of the C<#!> switches starts wherever "perl" is mentioned in the line.
ru_ru: Разбор опции C<#!> начинается там, где в строку входит слово "Perl".

source: Passed in implicitly via standard input.
ru_ru: Принятый в неявно через стандартный ввод.

source: Past contributors are: brian d foy C<< <bdfoy@cpan.org> >> Adriano R. Ferreira C<< <ferreira@cpan.org> >>, Sean M. Burke C<< <sburke@cpan.org> >>, Kenneth Albanowski C<< <kjahds@kjahds.com> >>, Andy Dougherty C<< <doughera@lafcol.lafayette.edu> >>, and many others.
ru_ru: Прошлые участники являются: brian d foy C<< <bdfoy@cpan.org> >> Adriano R. Ferreira C<< <ferreira@cpan.org> >>, Sean M. Burke C<< <sburke@cpan.org> >>, Kenneth Albanowski C<< <kjahds@kjahds.com> >>, Andy Dougherty C<< <doughera@lafcol.lafayette.edu> >>, and many others.

source: Perl actually inserts the following code:
ru_ru: Perl на самом деле вставляет следующий код:

source: Perl actually stands for Pathologically Eclectic Rubbish Lister, but don't tell anyone I said that.
ru_ru: Perl на самом деле обозначает Паталогически Эклектичный Мусорный Листер, но никому не говорите, что я сказал.

source: Perl also has environment variables that control how Perl handles data specific to particular natural languages; see L<perllocale>.
ru_ru: Perl также имеет переменные окружения, которые контролируют как Perl обрабатывает данные, специфичные для конкретного естественного языка, см. L <perllocale> .

source: Perl and its various modules and components, including its test frameworks, may sometimes make use of certain other environment variables.
ru_ru: Perl и его различные модули и компоненты, в том числе его рамках теста, иногда может сделать использование некоторых других переменных среды.

source: Perl associative arrays are called "hashes".
ru_ru: Perl ассоциативные массивы называются "хэшами".

source: Perl by default is very forgiving.
ru_ru: Perl по умолчанию может очень много простить.

source: Perl can be built so that it by default will try to execute F<$Config{sitelib}/sitecustomize.pl> at startup (in a BEGIN block).
ru_ru: Perl может быть построен так, что он по умолчанию будет пытаться выполнить F<$Config{sitelib}/sitecustomize.pl> при запуске (в блоке BEGIN).

source: Perl comes with a wide selection of builtin functions.
ru_ru: Perl поставляется с широким выбором встроенных функций.

source: Perl differentiates numeric comparison from string comparison.
ru_ru: Perl отличает числовое сравнение от сравнения строк.

source: Perl does not attempt to emulate the behavior of awk in which nonexistent array elements spring into existence simply by being referenced.
ru_ru: Perl не пытается эмулировать поведение AWK, в котором несуществующие элементы массива начинают существовать просто по созданию на них ссылки.

source: Perl does not expand C<~> in filenames, which is good, since some folks use it for their backup files:
ru_ru: Perl не интерполирует C<~> в именах файлов, и это хорошо, так как некоторые люди используют его для своих файлов резервных копий:

source: Perl has most of the usual conditional and looping constructs.
ru_ru: Perl имеет большинство обычных условных и циклических конструкций.

source: Perl has three main variable types: scalars, arrays, and hashes.
ru_ru: Perl имеет три основных типа переменных: скаляры, массивы и хэши.

source: Perl has two kinds of array, numerically-indexed and associative.
ru_ru: Perl имеет два вида массивов, численно-индексированных и ассоциативно.

source: Perl is a general-purpose programming language originally developed for text manipulation and now used for a wide range of tasks including system administration, web development, network programming, GUI development, and more.
ru_ru: Perl является универсальным языком программирования, первоначально разработанный для манипуляций с текстом и в настоящее время используется для широкого круга задач, включая системное администрирование, веб-разработки, сетевое программирование, разработка графического интерфейса и многое другое.

source: Perl is at the mercy of your machine's definitions of various operations such as type casting, atof(), and floating-point output with sprintf().
ru_ru: Perl отдает на милость определения вашей машины различных операций, таких как приведение типов, atof(), и с плавающей точкой вывод с sprintf().

source: Perl is available for most operating systems, including virtually all Unix-like platforms.
ru_ru: Perl доступен для большинства операционных систем, в том числе практически для всех Unix-подобных платформ.

source: Perl makes all environment variables available to the program being executed, and passes these along to any child processes it starts.
ru_ru: Perl делает все переменные среды, доступной для программы выполняются, и передает эти по любому ребенку, он начинает процесс.

source: Perl modules provide a range of features to help you avoid reinventing the wheel, and can be downloaded from CPAN ( http://www.cpan.org/ ).
ru_ru: Perl модули предоставляют широкий спектр функций, которые помогут вам не изобретать велосипед, их можно загрузить с CPAN (http://www.cpan.org/).

source: Perl normally searches for an IFS-compatible LSP because this is required for its emulation of Windows sockets as real filehandles.
ru_ru: Perl обычно ищет IFS-совместимых LSP, потому что это требуется для его эмуляции интерфейс Windows Sockets как реальные дескрипторов файлов.

source: Perl officially stands for Practical Extraction and Report Language, except when it doesn't.
ru_ru: Perl официально предназначается как Язык для Практического Извлечения и Создания отчетов, кроме случаев, когда это не так.

source: Perl operators are documented in full in L<perlop>, but here are a few of the most common ones:
ru_ru: Perl операторы полностью описаны в L<perlop> , но вот некоторые из наиболее распространенных из них:

source: Perl regexps also support backreferences, lookaheads, and all kinds of other complex details.
ru_ru: Perl регулярные выражения также поддерживают обратные ссылки, lookaheads, и все виды других сложных деталей.

source: Perl starts by assuming its equivalent, $#, to have the value %.20g.
ru_ru: Perl начинается, предполагая, что его эквивалент, $# должен иметь значение %.20g.

source: Perl statements end in a semi-colon:
ru_ru: Perl операторы имеют в конце точку с запятой:

source: Perl was originally a language optimized for scanning arbitrary text files, extracting information from those text files, and printing reports based on that information.
ru_ru: Perl был первоначально язык, оптимизированный для анализа произвольных текстовых файлов, извлечения информации из этих текстовых файлов и печати отчетов на основе этой информации.

source: Perl's regular expression support is both broad and deep, and is the subject of lengthy documentation in L<perlrequick>, L<perlretut>, and elsewhere.
ru_ru: Поддержка регулярных выражений Perl является как широкой и глубокой, и является предметом длинной документации в L<perlrequick>, L<perlretut> , И в других местах.

source: Perl's roots in text processing haven't been forgotten over the years.
ru_ru: Корни Perl в обработке текста не были забыты на протяжении многих лет.

source: Perldoc can also take you directly to documentation for functions (with the B<-f> switch).
ru_ru: Perldoc также предоставляет документацию по функциям (с опцией B<-f>).
